Revit 2027 API
ReferencePointArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	ReferencePoint item
)
Public Overridable Sub Append (
	item As ReferencePoint
)
public:
virtual void Append(
	ReferencePoint^ item
)
abstract Append :
        item : ReferencePoint -> unit
override Append :
        item : ReferencePoint -> unit
Parameters
item ReferencePoint
See Also
Reference
ReferencePointArray Class
Autodesk.Revit.DB Namespace